package jolimark

var ErrorMsgMap = map[int]string{
	0:     "成功",
	10000: "调用接口失败",
	10101: "app_id不存在",
	10102: "无效的访问令牌",
	10103: "访问令牌已过期",
	10104: "app_id已停止运营",
	10105: "签名失败",
	10106: "app_key不正确",
	10107: "参数验证不合格",
	10201: "打印机不存在",
	10202: "打印机已绑定在另一app_id，请联系客服！",
	10203: "打印机不属于此app_id,您无权解绑！",
	10204: "打印机未绑定，无需解绑！",
	10205: "打印设备与该app_id已绑定过！",
	10206: "打印机编码或校验码不能为空",
	10207: "app_id未绑定此打印设备",
	10301: "打印机未联网，不能创建任务！",
	20101: "非逻辑性的错误提示，比如参数格式错误，参数有效性提示等",
	30101: "系统处理数据不符合要求的提示信息",
	90100: "系统异常错误",
}

type Error struct {
	Code int
}

func (e Error) Error() string {
	return ErrorMsgMap[e.Code]
}
